app/views/listings/_form.html.haml

  %select.form-control{:name => "listing[category_id]"}
    - Category.all.each do |cat|
---
SELECT "categories".* FROM "categories"