app/views/listings/show.html.haml

  .col-xs-6
    - @listing.comments.each do |c|
---
SELECT "comments".* FROM "comments" WHERE "comments"."listing_id" = $1  [["listing_id", 25]]