app/controllers/account/comments_controller.rb

  def create
    @comment = Comment.create(
      user_id: current_user.id,
      content: params[:comment][:content],
      listing_id: params[:comment][:listing_id]
    )
---
INSERT INTO "comments" ("content", "user_id", "listing_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "ncncncn"], ["user_id", 4], ["listing_id", 25], ["created_at", 2016-11-21 12:23:17 UTC], ["updated_at", 2016-11-21 12:23:17 UTC]]